# 1) Даны 2 строки
# Определить, является ли одна строка анаграммой другой строки

# пила - исходная строка
# липа - ДА
# липпа - НЕТ

# 12334
# 41332

# x = 'пила'  -> [20, 10, 16, 1] -> sort K

# y = 'липа' -> [10, 10, 20, 1] -> sort M

# K == M

# russian_alphabet = [
#     'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 
#     'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 
#     'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я', 
# ]

x = [1, 2, 3]
y = [1, 2, 3]
print(x == y)

